In [76]:
import pandas as pd

adult_income_data = pd.read_csv('adult.csv', na_values='?') # 파일을 보니 none 대신 ? 로 결측치가 표시되어 있음 -> none로 변경

In [77]:
adult_income_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        46043 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       46033 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   47985 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [78]:
adult_income_data.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,NaN,103497,Some-college,10,Never-married,NaN,Own-child,White,Female,0,0,30,United-States,<=50K

In [79]:
adult_income_data.isnull().sum() # 각 열의 결측치 개수 확인

age                   0
workclass          2799
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2809
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      857
income                0
dtype: int64

In [80]:
adult_income_data.dropna(inplace=True) # 결측치가 있는 행 제거 -- 최대 2800개 밖에 안됨 미미하다고 판단하여 제거
adult_income_data.reset_index(drop=True, inplace=True) # 인덱스 재설정
print(f'결측치 제거 후 행 개수 : {len(adult_income_data)}')

결측치 제거 후 행 개수 : 45222

In [81]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()

columns = ['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'gender', 'native-country']

In [82]:
for col in columns:
    adult_income_data[col+'_label'] = label_encoder.fit_transform(adult_income_data[col])

In [83]:
adult_income_data.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,...,native-country,income,workclass_label,education_label,marital-status_label,occupation_label,relationship_label,race_label,gender_label,native-country_label
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,...,United-States,<=50K,2,1,4,6,3,2,1,38
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,...,United-States,<=50K,2,11,2,4,0,4,1,38
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,...,United-States,>50K,1,7,2,10,0,4,1,38
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,...,United-States,>50K,2,15,2,6,0,2,1,38
4,34,Private,198693,10th,6,Never-married,Other-service,Not-in-family,White,Male,...,United-States,<=50K,2,0,4,7,1,4,1,38